import React from 'react';

const Blogs = () => {
    return (
        <div style={{padding: '50px 10%', textAlign: 'justify'}}>
            <div>
                <h1>What is Context Api</h1>
                <p>কন্টেক্সট এপিআই হচ্ছে ডাটা পাসিং প্রক্রিয়া। সাধারণ ভাবে এক কম্পনেন্ট থেকে অন্য কম্পনেন্ট এ ডাটা পাস করতে হলে আমরা প্রপস এর মাধ্যমে ডাটা পাঠিয়ে থাকি। কিন্তু যদি এমন হয় প্যারেন্ট কম্পনেণ্ট A তার চাইল্ড কম্পনেন্ট B, B এর চাইল্ড কম্পনেন্ট C, C এর চাইল্ড কম্পনেন্ট D। এখন যদি A থেকে ডাটা D কম্পনেন্ট এ পাঠাতে চাই তাহলে A থেকে প্রপস এর মাধ্যমে B তে পাঠাতে হবে। B কম্পনেন্ট তার চাইল্ড C কম্পনেন্টকে প্রপস হিসেবে ডাটা পাঠাবে। C কম্পনেন্ট তার চাইল্ড D কম্পনেন্টকে প্রপস এর মাধ্যমে পাঠাবে। এখানেতো মাত্র ৪টা কম্পনেন্ট তাই হয়তো এভাবে ডাটা পাঠানো যাচ্ছে যদি এমন ৫০ বা ১০০ কম্পনেন্ট থাকে তাহলে কেমন হবে  প্রসেসটা অনেক কমপ্লেক্স হয়ে যাবে। কিন্তু যদি এমন হয় A থেকে ডাটা D কম্পনেন্ট এ সরাসরি ডাটা পাস করা যেতো তাহলে কেমন হতো। হ্যা এখানেই আসে কন্টেক্সট এপিআই। কন্টেক্সট এইপিআই এর মাধ্যমে কোন জামেলা ছারাই সরাসরি D কম্পনেন্ট এ ডাটা পাঠানো যায়। এখন যদি হাজারটা কম্পনেন্টও থাকে কোন সমস্যা ছারাই যেকোন কম্পনেন্ট এ ডাটা পাস করা যাবে। </p>
            </div>
            <div>
                <h1>Display block vs inline vs inline-block</h1>
                <p>সিএসএস বক্স মডেল অনুসারে এইচটিএমএল  এর সব এলিমেন্ট বক্স আকৃতীর হয়ে থাকে। এর মধ্যে কিছু ব্লক লেভেল এলিমেন্ট হয় আর কিছু ইনলাইন এলিমেন্ট। ব্লক লেভেল এলিমেন্ট একটা সেপারেট লাইনে বসে এবং বাই ডিফল্ট  available সম্পূর্ণ উইথ নিয়ে নেয় সেইম লাইন কারো সাথে শেয়ার করে না। অপর দিকে ইনলাইন এলিমেন্ট তার কনটেন্ট এর যত টুকু ঠিক ততটুকু যায়গায়ই সে নিয়ে থাকে তার ডানে বামে আরো এলিমেন্ট থাকতে পারে তাতে কোন প্রবলেম নেই। ডিফল্ট এই ভিহেবিয়ার কে সিএসএস সাহায্যে আমরা পরিবর্তন করতে পারি। যেমনঃ-
                ইনলাইন এলিমেন্টঃ  দুইটা ব্লক লেভেল এলিমেন্টকে display: 'inline' দিয়ে দিলে একটা এলিমেন্ট এর কন্টেন্ট শেষ হওয়ার পরেই নতুন আরেকটা ব্লক লেভেল এলিমেন্ট শুরু হয়ে যায় নতুন কোন লাইনে স্টার্ট হয় না।
                ব্লক এলিমেন্টঃ দুইটা ইনলাইন এলিমেন্টকে display: 'block' দিলে দুইটা আলাদা লাইনে চলে যাবে।
                ইনলাইন-ব্লক এলিমেন্টঃ ব্লক এবং ইনলাইন ব্লক খুবই কাছাকাছি ব্লক এলিমেন্ট নতুন লাইন তৈরি করে কিন্তু ইনলাইন-ব্লক নতুন লাইন তৈরি করেনা তাই অন্যান্য উপাদানের পাসে বসতে পারে। ইনলাইন এলিমেন্ট এ মার্জিন, প্যাডিং হাইট, উইথ এড করা যায় না কিন্তু ইনলাইনে-ব্লক এলিমেন্ট এ করা যায়। </p>
            </div>
        </div>
    );
};

export default Blogs;