[
    {
      "id": "1",
      "name": "Radib Al-Amin",
      "ratings": 5,
      "img": "https://s3-ap-southeast-1.amazonaws.com/rokomari110/user/97fda9c305444_109914.JPEG",
      "review": "হাবলুদের জন্য প্রোগ্রামিং” ঝংকার মাহবুবের সহজ ভাষায় একটি প্রোগ্রামের বই।লেখক তার বইয়ের ভিতরে খুব সহজ ভাষায় প্রোগ্রামের বর্ণনা , কি দরকার  ইত্যাদি সব নিয়ে লিখেছেন।খুব সহজ ও সাবলীল ভাষায় লিখা বইটি ছোটদের জন্য বেশ ভাল বই।চায়ের দোকানে বসে থাকা ২ বন্ধুর আলাপের মাধ্যমেই লেখক খুব সহজ ভাবে প্রোগ্রামের কাজ বর্ণনা করেছেন।বর্তমানে তো প্রোগ্রাম নিয়ে দেশে বা দেশের বাহিরে অনেক কাজ হচ্ছে বা প্রতিযোগিতা হচ্ছে।সেই সব প্রতিযোগিতায় আমাদের দেশের ছেলে মেয়েরাও অনেক ভাল করতেছে। অনেক পুরস্কার সহ সেরাদের সেরাও হচ্ছেন।যা আমাদের জন্য বেশ পজেটিভ।বইয়ের লেখক এই সব ব্যাপার গুলোকে মাথায় রেখেই বইটি লিখেছেন।নানা রঙ ও ঢং এ লিখা এই বইটি সকল ক্লাসের স্টুডেন্ট এর কাজে লাগবে।বইয়ের শুরুতেই ঝংকার মাহবুব “হাবলু নামা” নামে একটি সুন্দর কবিতা দিয়ে শুরু করেছেন। যা কি না সবার-ই ভাল লাগবে। সেই কবিতার মাধ্যমেও লেখক ছোট ছোট অনেক কিছু তুলে ধরেছেন।যা খুব সহজেই আমাদের বোধগম্য হবে।"
    },
    {
      "id": "2",
      "name": "কিংকর হালদার মিশু",
      "ratings": 5,
      "img": "https://s3-ap-southeast-1.amazonaws.com/rokomari110/user/c4d2082bb847a_127100.jpg",
      "review": "প্রোগ্রামিংয়ের মত একটা হ-য-ব-র-ল সাবজেক্টকে যে এতটা সুন্দর, সহজ ও সাবলীলভাবে উপস্থাপন করা যায়, এই বইটা পড়ার আগে তা জানতাম না। আগে অন্য কিছু লেখকের বই পড়েছিলাম। কিন্তু যতটুকুই পড়তাম, ততটুকুই ভুলে যেতাম। তাই কয়দিন মনোযোগ দিয়ে পড়লেও পড়ে আর মন বসতো না। এই বইটা পড়ার পর থেকে মনে হচ্ছে প্রোগ্রামিংয়ের মতো সহজ সাবজেক্ট আমি আজ পর্যন্ত পড়িনি আর আশা করি যতটুকু পড়েছি তা আর কোনোদিনও ভুলবো না। লেখক ঝংকার মাহবুব স্যারকে অসংখ্য ধন্যবাদ এমন অসাধারণ একটি বই রচনার জন্য। প্রোগ্রামিংয়ের বিভিন্ন বই যারা আগে পড়েছেন কিংবা যারা প্রোগ্রামিং মোটামোটি পারেন তাদেরও অনুরোধ করব বইটি অন্তত একবার পড়ার জন্য। প্রোগ্রামিং এর ভয় দূর করতে এবং বেসিক কনসেপ্টগুলো আত্মস্থ্য করতে বাংলায় লিখিত সেরা বই বলে আমি মনে করি। কম্পিউটার অনুরাগী, যারা কম্পিউটারে কিংবা মোবাইলে শুধু টাইপ করতে জানে, তারাও এই অসাধারণ বইটি পড়ে প্রোগ্রামিংয়ের বেসিক কনসেপ্ট পাবে। লেখকের মোবাইল ব্রাউজারের মাধ্যমে প্রোগ্রামিং শেখার ব্যবস্থাটা আমার খুব ভালো লেগেছে। সম্প্রতি প্রোগ্রামিংয়ের উপর লেখকের আরেকটি বই বের হয়েছে। তাতে প্রোগ্রামিংয়ের পরবর্তী ধাপগুলো আলোচনা করা হয়েছ। আমি লেখকের দীর্ঘায়ু কামনা করি। আশা করি পরবর্তীতে প্রোগ্রামিংয়ের জটিল বিষয়গুলো নিয়ে লেখকের আরও বই পাব।"
    },
    {
      "id": "3",
      "name": "Nowshin Tasnuva Aurpa",
      "ratings": 5,
      "img": "https://s3-ap-southeast-1.amazonaws.com/rokomari110/user/2872e70da7864_72638.jpeg",
      "review": "আজ থেকে প্রায় এক যুগেরও বেশি সময় পূর্বে যখন আমার প্রোগ্রামিংয়ে হাতে খড়ি হয়েছিল, তখন প্রোগ্রামিং জিনিসটা কি তা ঠিকভাবে বুঝতাম না। তখন শুধুমাত্র পরীক্ষায় পাশ করার জন্যই প্রোগ্রামিং করতে হয়েছিল। তখনকার সবচেয়ে বিভীষিকাময় বিষয় ছিল প্রোগ্রামিং। তবে আজ পোগ্রামিং বিষয়টা যেন নিজের রক্তের সাথে মিশে গেছে। তোমরা যারা প্রোগ্রামিং শুরু করতে চাও, অথবা শুরু করা হয় হয় করে শুরু করতে পারছ না। তাদের জন্য ঝংকার মাহমুদের 'হাবলুদের জন্য প্রোগ্রামিং' বইটা হাতে খড়ি হতে পারে। যেমন বাংলা ভাষার শুরু করার জন্য স্বরবর্ণ ব্যঞ্জনবর্ণ, তেমনি বলা যায় প্রোগ্রামিং তোমরা যারা শুরু করবে তাদের জন্য বইটি স্বরবর্ণ ব্যঞ্জনবর্ণ।"
    },
    {
      "id": "4",
      "name": "Md. Atik Israk",
      "ratings": 5,
      "img": "https://s3-ap-southeast-1.amazonaws.com/rokomari110/user/0a7d405290db4_311057.jpg",
      "review": "বস! আপনার বইটা কিনে 2 দিনেই পড়ে প্র্যাকটিস সহ শেষ করে ফেলেছি! অথচ দুই দিনে আমি যা বুঝেছি তা পুরো এক সেমিষ্টারে বুঝতে পারিনি! অবজেক্ট অরিয়েন্টেড প্রোগ্রামিং ক্লাশে বেসিক কন্সেপ্ট না বুঝতে পেরে বাধ্য হয়ে প্রোগ্রাম মুখস্ত করে রেজাল্ট খারাপ করেছিলাম। কিন্তু যখনই আপনার হাবলুদের জন্য প্রোগ্রামিং বইটি বইমেলে থেকে কিনলাম মাত্র ২ দিনে প্র্যাকটিস সহ শেষ করে ফেললাম। "
    },
    {
      "id": "5",
      "name": "Kazi Nihal Towfiq",
      "ratings": 5,
      "img": "https://s3-ap-southeast-1.amazonaws.com/rokomari110/user/656eeeaafeeb4_119967.jpeg",
      "review": "প্রথমত, আপনার লেখার ইউনিক স্টাইল, গল্প ও ভাষা আমার মতো ফাকিবাজ  ছাত্রদেরকে বই এর পাতায় চম্বুকের মতো আটকে রাখে। টুকটাক সি প্রোগ্রামিং পারি কিন্তু অনেক আগে থেকে জাভাস্ক্রিপ্ট শেখার ইচ্ছা কিন্তু বাংলা ভাষায় সঠিক বই পায়নি। যখন জানলাম এই বই জাভাস্ক্রিপ্ট কে ভিত্তি করে লেখা তখন আর দেরী না করে কিনে ফেলি। কলেজের(পলিটেকনিক) ৪বছরে যা শিখেনি তা এই বইএর মাধ্যমে অনেকটায় শিখে ফেলছি। বইয়ের সব থেকে ভালো দিক হচ্ছে প্রতিটা টপিক গল্পের মাধ্যমে এক্সপ্লেইন করা যার ফলে কনফিউশন থাকে না। আপনাকে অনেক ধন্যবাদ !! "
    },
    {
      "id": "6",
      "name": "Kazi Nihal Towfiq",
      "ratings": 5,
      "img": "https://lh3.googleusercontent.com/a-/AOh14GikvxgDfhJrZUjZLmg_cSntBwWsA3zKOOw9uwhk6w=s96-c",
      "review": "just awesome ..i think this might be a great book.if you are poor in c programming,you should follow this book..after the end of reading this book  you can be a  great programmer..it is helpful for an olympiad participants, for cse student can develop their base and basic of c programming.so you must buy this book and read it and learn c programme"
    }
  ]